ProductRecommendation/src/main/java/com/prime/soap/api.xml


[<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<LoginResponse xmlns="http://www.acumatica.com/generic/">
			<LoginResult>
				<Code>OK</Code>
				<Session>lviwhmtytgh0afj2vc2m0fcn</Session>
			</LoginResult>
		</LoginResponse>
	</soap:Body>
</soap:Envelope>
] for request [
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<ns2:Login xmlns:ns2="http://www.acumatica.com/generic/">
			<ns2:name>MYOB@prime</ns2:name>
			<ns2:password>n0kbFAgA</ns2:password>
		</ns2:Login>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
]